AlmAck/svdtonuttx/demo/h/da1470x_charger.h
/* CHARGER_CC_CHARGE_TIMER Register */

#define CHARGER_CC_CHARGE_TIMER_MASK                       (0x7FFF << 16) /* Returns the current value of the CC-Charge timeout counter, running at a 1-Hz cl */
#define CHARGER_CC_CHARGE_TIMER_POS                        (16) /* Returns the current value of the CC-Charge timeout counter, running at a 1-Hz cl */
#define CHARGER_MAX_CC_CHARGE_TIME_MASK                    (0x7FFF << 0) /* This bit-field determines the maximum time (measured in ticks of the Charger's 1 */
#define CHARGER_MAX_CC_CHARGE_TIME_POS                     (0) /* This bit-field determines the maximum time (measured in ticks of the Charger's 1 */

/* CHARGER_CTRL Register */

#define CHARGER_EOC_TRIGGER                                (1U << 28) /* 0: Edge-sensitive End-of-Charge detection support is enabled (default). The Char */
#define CHARGER_EOC_INTERVAL_CHECK_TIMER_MASK              (0x3F << 22) /* The specific bit-field determines the current state of the timer used to periodi */
#define CHARGER_EOC_INTERVAL_CHECK_TIMER_POS               (22) /* The specific bit-field determines the current state of the timer used to periodi */
#define CHARGER_EOC_INTERVAL_CHECK_THRES_MASK              (0x3F << 16) /* This bit-field determines the periodic interval of checking the End-of-Charge si */
#define CHARGER_EOC_INTERVAL_CHECK_THRES_POS               (16) /* This bit-field determines the periodic interval of checking the End-of-Charge si */
#define CHARGER_REPLENISH_MODE                             (1U << 15) /* When this bit-field is set and the Charger's FSM is in the BYPASSED state (thus, */
#define CHARGER_PRE_CHARGE_MODE                            (1U << 14) /* When set, this bit-field enables a signal of the same name with the bit-field, d */
#define CHARGER_CHARGE_LOOP_HOLD                           (1U << 13) /* When set, this bit-field disables charging, provided that the Charger's FSM has  */
#define CHARGER_JEITA_SUPPORT_DISABLED                     (1U << 12) /* 0: Charger's JEITA FSM monitoring the battery temperature checks also if battery */
#define CHARGER_TBAT_MONITOR_MODE_MASK                     (0x3 << 10) /* Battery temperature pack monitoring modes, according to the following encoding:  */
#define CHARGER_TBAT_MONITOR_MODE_POS                      (10) /* Battery temperature pack monitoring modes, according to the following encoding:  */
#define CHARGER_CHARGE_TIMERS_HALT_ENABLE                  (1U << 9) /* 0: Charge timeout timers continue running when charging is disabled because of a */
#define CHARGER_STOP_CHARGE_TIMERS                         (1U << 8) /* 0: Charger's Pre-Charge, CC, CV and Total charge timeout timers are ticking prop */
#define CHARGER_NTC_LOW_DISABLE                            (1U << 7) /* 0: Charging is disabled when the battery temperature is found to have reached th */
#define CHARGER_TBAT_PROT_ENABLE                           (1U << 6) /* 0: Battery temperature protection disabled 1: Battery temperature protection ena */
#define CHARGER_TDIE_ERROR_RESUME                          (1U << 5) /* 0: FSM will not resume from a Die temperature error. Consequently, its state wil */
#define CHARGER_TDIE_PROT_ENABLE                           (1U << 4) /* 0: Die temperature protection is disabled, thus charging will not be disabled by */
#define CHARGER_CHARGER_RESUME                             (1U << 3) /* 0: Charger's FSM is not enable to resume from a charge timeout error or a Vbat O */
#define CHARGER_CHARGER_BYPASS                             (1U << 2) /* 0: Charger's FSM is active and running, notifying SW upon switching between its  */
#define CHARGER_CHARGE_START                               (1U << 1) /* 0: Charger's FSM is disabled, FSM stays at "DISABLED" state 1: Charger's FSM is  */
#define CHARGER_CHARGER_ENABLE                             (1U << 0) /* 0: Charger's analogue circuitry is powered-down 1: Charger's analogue circuitry  */

/* CHARGER_CURRENT_PARAM Register */

#define CHARGER_I_EOC_DOUBLE_RANGE                         (1U << 15) /* When set, the specific bit-field enables an increase of the (%) range of End-of- */
#define CHARGER_I_END_OF_CHARGE_MASK                       (0x7 << 12) /* End-of-Charge current setting, ranging from 6 %("000") to 20 % ("111") of the ch */
#define CHARGER_I_END_OF_CHARGE_POS                        (12) /* End-of-Charge current setting, ranging from 6 %("000") to 20 % ("111") of the ch */
#define CHARGER_I_PRECHARGE_MASK                           (0x3F << 6) /* This bit-field determines the Pre-Charge current, in mA, ranging from 0.5 to 72  */
#define CHARGER_I_PRECHARGE_POS                            (6) /* This bit-field determines the Pre-Charge current, in mA, ranging from 0.5 to 72  */
#define CHARGER_I_CHARGE_MASK                              (0x3F << 0) /* This bit-field determines the charge current range, in mA. The range is from 5 m */
#define CHARGER_I_CHARGE_POS                               (0) /* This bit-field determines the charge current range, in mA. The range is from 5 m */

/* CHARGER_CURRENT_STATUS Register */

#define CHARGER_I_PRECHARGE_SET_MASK                       (0x3F << 6) /* This bit-field returns the applied Pre-Charge current setting. In JEITA charging */
#define CHARGER_I_PRECHARGE_SET_POS                        (6) /* This bit-field returns the applied Pre-Charge current setting. In JEITA charging */
#define CHARGER_I_CHARGE_SET_MASK                          (0x3F << 0) /* This bit-field returns the applied CC current setting. In JEITA charging, it con */
#define CHARGER_I_CHARGE_SET_POS                           (0) /* This bit-field returns the applied CC current setting. In JEITA charging, it con */

/* CHARGER_CV_CHARGE_TIMER Register */

#define CHARGER_CV_CHARGE_TIMER_MASK                       (0x7FFF << 16) /* Returns the current value of the CV-Charge timeout counter, running at a 1-Hz cl */
#define CHARGER_CV_CHARGE_TIMER_POS                        (16) /* Returns the current value of the CV-Charge timeout counter, running at a 1-Hz cl */
#define CHARGER_MAX_CV_CHARGE_TIME_MASK                    (0x7FFF << 0) /* This bit-field determines the maximum time (measured in ticks of the Charger's 1 */
#define CHARGER_MAX_CV_CHARGE_TIME_POS                     (0) /* This bit-field determines the maximum time (measured in ticks of the Charger's 1 */

/* CHARGER_ERROR_IRQ_CLR Register */

#define CHARGER_TBAT_ERROR_IRQ_CLR                         (1U << 6) /* Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a */
#define CHARGER_TDIE_ERROR_IRQ_CLR                         (1U << 5) /* Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a */
#define CHARGER_VBAT_OVP_ERROR_IRQ_CLR                     (1U << 4) /* Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a */
#define CHARGER_TOTAL_CHARGE_TIMEOUT_IRQ_CLR               (1U << 3) /* Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a */
#define CHARGER_CV_CHARGE_TIMEOUT_IRQ_CLR                  (1U << 2) /* Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a */
#define CHARGER_CC_CHARGE_TIMEOUT_IRQ_CLR                  (1U << 1) /* Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a */
#define CHARGER_PRECHARGE_TIMEOUT_IRQ_CLR                  (1U << 0) /* Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a */

/* CHARGER_ERROR_IRQ_MASK Register */

#define CHARGER_TBAT_ERROR_IRQ_EN                          (1U << 6) /* When set, it enables the generation of Battery temperature IRQs.The IRQ is gener */
#define CHARGER_TDIE_ERROR_IRQ_EN                          (1U << 5) /* When set, it enables the generation of Die temperature error IRQs. The IRQ is ge */
#define CHARGER_VBAT_OVP_ERROR_IRQ_EN                      (1U << 4) /* When set, it enables the generation of VBAT_OVP IRQs. The IRQ is generated as so */
#define CHARGER_TOTAL_CHARGE_TIMEOUT_IRQ_EN                (1U << 3) /* When set, it enables the total charge timeout IRQs. The IRQ is generated as soon */
#define CHARGER_CV_CHARGE_TIMEOUT_IRQ_EN                   (1U << 2) /* When set, it enables the CV charge timeout IRQs. The IRQ is generated as soon as */
#define CHARGER_CC_CHARGE_TIMEOUT_IRQ_EN                   (1U << 1) /* When set, it enables the CC charge timeout IRQs. The IRQ is generated as soon as */
#define CHARGER_PRECHARGE_TIMEOUT_IRQ_EN                   (1U << 0) /* When set, it enables the Pre-Charge timeout IRQs. The IRQ is generated as soon a */

