AlmAck/svdtonuttx/demo/h/da1470x_charger.h
/* CHARGER_ERROR_IRQ_STATUS Register */

#define CHARGER_TBAT_ERROR_IRQ                             (1U << 6) /* 0 = No Battery temperature error IRQ event is captured, so charging may continue */
#define CHARGER_TDIE_ERROR_IRQ                             (1U << 5) /* 0 = No Die temperature error IRQ events have been captured, so charging may cont */
#define CHARGER_VBAT_OVP_ERROR_IRQ                         (1U << 4) /* 0 = Vbat has not exceeded the Over-Voltage Protection (OVP) level, so charging m */
#define CHARGER_TOTAL_CHARGE_TIMEOUT_IRQ                   (1U << 3) /* 0 = Total charge time counter has not yet reached the maximum charge time (set i */
#define CHARGER_CV_CHARGE_TIMEOUT_IRQ                      (1U << 2) /* 0 = State charge time counter has not yet reached the maximum CV charge time (se */
#define CHARGER_CC_CHARGE_TIMEOUT_IRQ                      (1U << 1) /* 0 = State charge time counter has not yet reached the maximum CC charge time (se */
#define CHARGER_PRECHARGE_TIMEOUT_IRQ                      (1U << 0) /* 0 = State charge time counter has not yet reached the maximum Pre-charge time (s */

/* CHARGER_JEITA_CURRENT2 Register */

#define CHARGER_I_PRECHARGE_TWARMER_MASK                   (0x3F << 18) /* Pre-charge current settings bit-field for the "WARMER" battery temperature pack  */
#define CHARGER_I_PRECHARGE_TWARMER_POS                    (18) /* Pre-charge current settings bit-field for the "WARMER" battery temperature pack  */
#define CHARGER_I_PRECHARGE_TCOOLER_MASK                   (0x3F << 12) /* Pre-charge current settings bit-field for the "COOLER" battery temperature pack  */
#define CHARGER_I_PRECHARGE_TCOOLER_POS                    (12) /* Pre-charge current settings bit-field for the "COOLER" battery temperature pack  */
#define CHARGER_I_CHARGE_TWARMER_MASK                      (0x3F << 6) /* Charge current settings bit-field for the "WARMER" battery temperature pack zone */
#define CHARGER_I_CHARGE_TWARMER_POS                       (6) /* Charge current settings bit-field for the "WARMER" battery temperature pack zone */
#define CHARGER_I_CHARGE_TCOOLER_MASK                      (0x3F << 0) /* Charge current settings bit-field for the "COOLER" battery temperature pack zone */
#define CHARGER_I_CHARGE_TCOOLER_POS                       (0) /* Charge current settings bit-field for the "COOLER" battery temperature pack zone */

/* CHARGER_JEITA_CURRENT Register */

#define CHARGER_I_PRECHARGE_TWARM_MASK                     (0x3F << 18) /* Pre-Charge current setting for the Warm battery temperature zone. Regarding the  */
#define CHARGER_I_PRECHARGE_TWARM_POS                      (18) /* Pre-Charge current setting for the Warm battery temperature zone. Regarding the  */
#define CHARGER_I_PRECHARGE_TCOOL_MASK                     (0x3F << 12) /* Pre-Charge current setting for the Cool battery temperature zone. Regarding the  */
#define CHARGER_I_PRECHARGE_TCOOL_POS                      (12) /* Pre-Charge current setting for the Cool battery temperature zone. Regarding the  */
#define CHARGER_I_CHARGE_TWARM_MASK                        (0x3F << 6) /* Charge current setting for the Warm battery temperature pack zone. Regarding the */
#define CHARGER_I_CHARGE_TWARM_POS                         (6) /* Charge current setting for the Warm battery temperature pack zone. Regarding the */
#define CHARGER_I_CHARGE_TCOOL_MASK                        (0x3F << 0) /* Charge current setting for the "COOL" battery temperature level. Regarding the r */
#define CHARGER_I_CHARGE_TCOOL_POS                         (0) /* Charge current setting for the "COOL" battery temperature level. Regarding the r */

/* CHARGER_JEITA_V_CHARGE Register */

#define CHARGER_V_CHARGE_TWARMER_MASK                      (0x3F << 18) /* Charge voltage setting for the Warmer battery temperature zone. Regarding the ra */
#define CHARGER_V_CHARGE_TWARMER_POS                       (18) /* Charge voltage setting for the Warmer battery temperature zone. Regarding the ra */
#define CHARGER_V_CHARGE_TCOOLER_MASK                      (0x3F << 12) /* Charge voltage setting for the Cooler battery temperature zone. Regarding the ra */
#define CHARGER_V_CHARGE_TCOOLER_POS                       (12) /* Charge voltage setting for the Cooler battery temperature zone. Regarding the ra */
#define CHARGER_V_CHARGE_TWARM_MASK                        (0x3F << 6) /* Charge voltage setting for the Warm battery temperature zone. Regarding the rang */
#define CHARGER_V_CHARGE_TWARM_POS                         (6) /* Charge voltage setting for the Warm battery temperature zone. Regarding the rang */
#define CHARGER_V_CHARGE_TCOOL_MASK                        (0x3F << 0) /* Charge voltage setting for the Cool battery temperature zone. Regarding the rang */
#define CHARGER_V_CHARGE_TCOOL_POS                         (0) /* Charge voltage setting for the Cool battery temperature zone. Regarding the rang */

/* CHARGER_JEITA_V_OVP Register */

#define CHARGER_V_OVP_TWARMER_MASK                         (0x3F << 18) /* VBAT Over-voltage Protection (OVP) setting for the Warmer battery temperature zo */
#define CHARGER_V_OVP_TWARMER_POS                          (18) /* VBAT Over-voltage Protection (OVP) setting for the Warmer battery temperature zo */
#define CHARGER_V_OVP_TCOOLER_MASK                         (0x3F << 12) /* VBAT Over-voltage Protection (OVP) setting for the Cooler battery temperature zo */
#define CHARGER_V_OVP_TCOOLER_POS                          (12) /* VBAT Over-voltage Protection (OVP) setting for the Cooler battery temperature zo */
#define CHARGER_V_OVP_TWARM_MASK                           (0x3F << 6) /* VBAT Over-voltage Protection (OVP) setting for the Warm battery temperature zone */
#define CHARGER_V_OVP_TWARM_POS                            (6) /* VBAT Over-voltage Protection (OVP) setting for the Warm battery temperature zone */
#define CHARGER_V_OVP_TCOOL_MASK                           (0x3F << 0) /* VBAT Over-voltage Protection (OVP) setting for the Cool battery temperature zone */
#define CHARGER_V_OVP_TCOOL_POS                            (0) /* VBAT Over-voltage Protection (OVP) setting for the Cool battery temperature zone */

/* CHARGER_JEITA_V_PRECHARGE Register */

#define CHARGER_V_PRECHARGE_TWARMER_MASK                   (0x3F << 18) /* Pre-Charge voltage setting for the Warmer battery temperature zone. Regarding th */
#define CHARGER_V_PRECHARGE_TWARMER_POS                    (18) /* Pre-Charge voltage setting for the Warmer battery temperature zone. Regarding th */
#define CHARGER_V_PRECHARGE_TCOOLER_MASK                   (0x3F << 12) /* Pre-Charge voltage setting for the Cooler battery temperature zone. Regarding th */
#define CHARGER_V_PRECHARGE_TCOOLER_POS                    (12) /* Pre-Charge voltage setting for the Cooler battery temperature zone. Regarding th */
#define CHARGER_V_PRECHARGE_TWARM_MASK                     (0x3F << 6) /* Pre-Charge voltage setting for the Warm battery temperature zone. Regarding the  */
#define CHARGER_V_PRECHARGE_TWARM_POS                      (6) /* Pre-Charge voltage setting for the Warm battery temperature zone. Regarding the  */
#define CHARGER_V_PRECHARGE_TCOOL_MASK                     (0x3F << 0) /* Pre-Charge current setting for the Cool battery temperature zone. Regarding the  */
#define CHARGER_V_PRECHARGE_TCOOL_POS                      (0) /* Pre-Charge current setting for the Cool battery temperature zone. Regarding the  */

/* CHARGER_JEITA_V_REPLENISH Register */

