AlmAck/svdtonuttx/demo/h/da1470x_charger.h
#define CHARGER_V_REPLENISH_TWARMER_MASK                   (0x3F << 18) /* Replenish voltage setting for the Warmer battery temperature zone. Regarding the */
#define CHARGER_V_REPLENISH_TWARMER_POS                    (18) /* Replenish voltage setting for the Warmer battery temperature zone. Regarding the */
#define CHARGER_V_REPLENISH_TCOOLER_MASK                   (0x3F << 12) /* Replenish voltage setting for the Cooler battery temperature zone. Regarding the */
#define CHARGER_V_REPLENISH_TCOOLER_POS                    (12) /* Replenish voltage setting for the Cooler battery temperature zone. Regarding the */
#define CHARGER_V_REPLENISH_TWARM_MASK                     (0x3F << 6) /* Replenish voltage setting for the Warm battery temperature zone. Regarding the r */
#define CHARGER_V_REPLENISH_TWARM_POS                      (6) /* Replenish voltage setting for the Warm battery temperature zone. Regarding the r */
#define CHARGER_V_REPLENISH_TCOOL_MASK                     (0x3F << 0) /* Replenish voltage setting for the Cool battery temperature zone. Regarding the r */
#define CHARGER_V_REPLENISH_TCOOL_POS                      (0) /* Replenish voltage setting for the Cool battery temperature zone. Regarding the r */

/* CHARGER_LOCK Register */

#define CHARGER_CHARGER_SWLOCK_EN                          (1U << 15) /* 0 = SW-based protection of Charger registers is disabled, protection is dependen */
#define CHARGER_JEITA_I_CHARGE2_LOCK                       (1U << 14) /* 0 = CHARGER_JEITA_CURRENT2_REG is un-locked, register writes are allowed 1 = CHA */
#define CHARGER_JEITA_I_CHARGE_LOCK                        (1U << 13) /* 0 = CHARGER_JEITA_CURRENT_REG is un-locked, register writes are allowed 1 = CHAR */
#define CHARGER_JEITA_V_OVP_LOCK                           (1U << 12) /* 0 = CHARGER_JEITA_V_OVP_REG is un-locked, register writes are allowed 1 = CHARGE */
#define CHARGER_JEITA_V_PRECHARGE_LOCK                     (1U << 11) /* 0 = CHARGER_JEITA_V_PRECHARGE_REG is un-locked, register writes are allowed 1 =  */
#define CHARGER_JEITA_V_CHARGE_LOCK                        (1U << 10) /* 0 = CHARGER_JEITA_V_CHARGE_REG is un-locked, register writes are allowed 1 = CHA */
#define CHARGER_TOTAL_CHARGE_TIMEOUT_LOCK                  (1U << 9) /* 0 = CHARGER_TOTAL_CHARGE_TIMER_REG is un-locked, register writes are allowed 1 = */
#define CHARGER_CV_CHARGE_TIMEOUT_LOCK                     (1U << 8) /* 0 = CHARGER_CV_CHARGE_TIMER_REG is un-locked, register writes are allowed 1 = CH */
#define CHARGER_CC_CHARGE_TIMEOUT_LOCK                     (1U << 7) /* 0 = CHARGER_CC_CHARGE_TIMER_REG is un-locked, register writes are allowed 1 = CH */
#define CHARGER_PRECHARGE_TIMEOUT_LOCK                     (1U << 6) /* 0 = CHARGER_PRE_CHARGE_TIMER_REG is un-locked, register writes are allowed 1 = C */
#define CHARGER_TEMPSET2_PARAM_LOCK                        (1U << 5) /* 0 = CHARGER_TEMPSET2_PARAM_REG is un-locked, register writes are allowed 1 = CHA */
#define CHARGER_TEMPSET_PARAM_LOCK                         (1U << 4) /* 0 = CHARGER_TEMPSET_PARAM_REG is un-locked, register writes are allowed 1 = CHAR */
#define CHARGER_CURRENT_PARAM_LOCK                         (1U << 3) /* 0 = CHARGER_CURRENT_PARAM_REG is un-locked, writes are allowed 1 = All bit-field */
#define CHARGER_VOLTAGE_PARAM_LOCK                         (1U << 2) /* 0 = CHARGER_VOLTAGE_PARAM_REG is un-locked, register writes are allowed 1 = All  */
#define CHARGER_CHARGER_TEST_CTRL_LOCK                     (1U << 1) /* 0 = CHARGER_TEST_CTRL_REG is un-locked, register writes are allowed 1 = CHARGER_ */
#define CHARGER_CHARGER_CTRL_LOCK                          (1U << 0) /* 0 = Protected bit-fields of CHARGER_CTRL_REG are un-locked, register writes are  */

/* CHARGER_PRE_CHARGE_TIMER Register */

#define CHARGER_PRE_CHARGE_TIMER_MASK                      (0x7FFF << 16) /* Returns the current value of the Pre-Charge timeout counter, running at a 1-Hz c */
#define CHARGER_PRE_CHARGE_TIMER_POS                       (16) /* Returns the current value of the Pre-Charge timeout counter, running at a 1-Hz c */
#define CHARGER_MAX_PRE_CHARGE_TIME_MASK                   (0x7FFF << 0) /* This bit-field determines the maximum time (measured in ticks of the Charger's 1 */
#define CHARGER_MAX_PRE_CHARGE_TIME_POS                    (0) /* This bit-field determines the maximum time (measured in ticks of the Charger's 1 */

/* CHARGER_PWR_UP_TIMER Register */

#define CHARGER_CHARGER_PWR_UP_TIMER_MASK                  (0x1F << 16) /* Returns the current value of the charger's power-up timer, running with the 1Khz */
#define CHARGER_CHARGER_PWR_UP_TIMER_POS                   (16) /* Returns the current value of the charger's power-up timer, running with the 1Khz */
#define CHARGER_CHARGER_PWR_UP_SETTLING_MASK               (0x1F << 0) /* This bit-field determines the charger's power-up (settling) time, required for t */
#define CHARGER_CHARGER_PWR_UP_SETTLING_POS                (0) /* This bit-field determines the charger's power-up (settling) time, required for t */

/* CHARGER_STATE_IRQ_CLR Register */

#define CHARGER_CV_TO_PRECHARGE_IRQ_CLR                    (1U << 11) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CHARGER_CC_TO_PRECHARGE_IRQ_CLR                    (1U << 10) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CHARGER_CV_TO_CC_IRQ_CLR                           (1U << 9) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CHARGER_TBAT_STATUS_UPDATE_IRQ_CLR                 (1U << 8) /* Writing a 1 will reset the Battery temperature status update IRQ status bit ; wr */
#define CHARGER_TBAT_PROT_TO_PRECHARGE_IRQ_CLR             (1U << 7) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CHARGER_TDIE_PROT_TO_PRECHARGE_IRQ_CLR             (1U << 6) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CHARGER_EOC_TO_PRECHARGE_IRQ_CLR                   (1U << 5) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CHARGER_CV_TO_EOC_IRQ_CLR                          (1U << 4) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CHARGER_CC_TO_EOC_IRQ_CLR                          (1U << 3) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CHARGER_CC_TO_CV_IRQ_CLR                           (1U << 2) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CHARGER_PRECHARGE_TO_CC_IRQ_CLR                    (1U << 1) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CHARGER_DISABLED_TO_PRECHARGE_IRQ_CLR              (1U << 0) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */

/* CHARGER_STATE_IRQ_MASK Register */

