AlmAck/svdtonuttx/demo/h/da1470x_charger.h
#define CHARGER_CV_TO_PRECHARGE_IRQ_EN                     (1U << 11) /* When set, this bit-field enables the IRQ generation as soon as the Charger's FSM */
#define CHARGER_CC_TO_PRECHARGE_IRQ_EN                     (1U << 10) /* When set, this bit-field enables the IRQ generation as soon as the Charger's FSM */
#define CHARGER_CV_TO_CC_IRQ_EN                            (1U << 9) /* When set, this bit-field enables the IRQ generation as soon as the Charger's FSM */
#define CHARGER_TBAT_STATUS_UPDATE_IRQ_EN                  (1U << 8) /* When set, this bit-field enables the generation of the Charger's state IRQ as so */
#define CHARGER_TBAT_PROT_TO_PRECHARGE_IRQ_EN              (1U << 7) /* When set, this bit-field enables the Charger's state IRQ generation as soon as t */
#define CHARGER_TDIE_PROT_TO_PRECHARGE_IRQ_EN              (1U << 6) /* When set, this bit-field enables the Charger's state IRQ generation as soon as t */
#define CHARGER_EOC_TO_PRECHARGE_IRQ_EN                    (1U << 5) /* When set, this bit-field enables the Charger's State IRQ generation as soon as t */
#define CHARGER_CV_TO_EOC_IRQ_EN                           (1U << 4) /* When set, this bit-field enables the IRQ generation as soon as the Charger's FSM */
#define CHARGER_CC_TO_EOC_IRQ_EN                           (1U << 3) /* When set, this bit-field enables the IRQ generation as soon as the Charger's FSM */
#define CHARGER_CC_TO_CV_IRQ_EN                            (1U << 2) /* When set, this bit-field enables the IRQ generation as soon as the Charger's FSM */
#define CHARGER_PRECHARGE_TO_CC_IRQ_EN                     (1U << 1) /* When set, this bit-field enables the IRQ generation as soon as the Charger's FSM */
#define CHARGER_DISABLED_TO_PRECHARGE_IRQ_EN               (1U << 0) /* When set, this bit-field enables the IRQ generation as soon as the Charger's FSM */

/* CHARGER_STATE_IRQ_STATUS Register */

#define CHARGER_CV_TO_PRECHARGE_IRQ                        (1U << 11) /* 0 = No transition of the Charger's FSM from CV_CHARGE to PRE_CHARGE state has be */
#define CHARGER_CC_TO_PRECHARGE_IRQ                        (1U << 10) /* 0 = No transition of the Charger's FSM from CC_CHARGE to PRE_CHARGE state has be */
#define CHARGER_CV_TO_CC_IRQ                               (1U << 9) /* 0 = No transition of the Charger's FSM from CV_CHARGE to CC_CHARGE state has bee */
#define CHARGER_TBAT_STATUS_UPDATE_IRQ                     (1U << 8) /* 0 = No battery temperature status update event has been captured 1 = Battery tem */
#define CHARGER_TBAT_PROT_TO_PRECHARGE_IRQ                 (1U << 7) /* 0 = No transition of the Charger's FSM from TBAT_PROT to PRE_CHARGE state has be */
#define CHARGER_TDIE_PROT_TO_PRECHARGE_IRQ                 (1U << 6) /* 0 = No transition of the Charger's FSM from TDIE_PROT to PRE_CHARGE state has be */
#define CHARGER_EOC_TO_PRECHARGE_IRQ                       (1U << 5) /* 0 = No transition of the Charger's FSM from END_OF_CHARGE to PRE_CHARGE state ha */
#define CHARGER_CV_TO_EOC_IRQ                              (1U << 4) /* 0 = No transition of the Charger's FSM from CV_CHARGE to END_OF_CHARGE state has */
#define CHARGER_CC_TO_EOC_IRQ                              (1U << 3) /* 0 = No transition of the Charger's FSM from CC_CHARGE to END_OF_CHARGE state has */
#define CHARGER_CC_TO_CV_IRQ                               (1U << 2) /* 0 = No transition of the Charger's FSM from CC_CHARGE to CV_CHARGE state has bee */
#define CHARGER_PRECHARGE_TO_CC_IRQ                        (1U << 1) /* 0 = No transition of the Charger's FSM from PRE_CHARGE to CC_CHARGE state has be */
#define CHARGER_DISABLED_TO_PRECHARGE_IRQ                  (1U << 0) /* 0 = No transition of the Charger's FSM from DISABLED to PRE_CHARGE state has bee */

/* CHARGER_STATUS Register */

#define CHARGER_OVP_EVENTS_DEBOUNCE_CNT_MASK               (0x7 << 26) /* The specific bit-field returns the consecutive number of times Vbat has exceeded */
#define CHARGER_OVP_EVENTS_DEBOUNCE_CNT_POS                (26) /* The specific bit-field returns the consecutive number of times Vbat has exceeded */
#define CHARGER_EOC_EVENTS_DEBOUNCE_CNT_MASK               (0x7 << 23) /* The specific bit-field returns the number of times the End-of-Charge signal has  */
#define CHARGER_EOC_EVENTS_DEBOUNCE_CNT_POS                (23) /* The specific bit-field returns the number of times the End-of-Charge signal has  */
#define CHARGER_TDIE_ERROR_DEBOUNCE_CNT_MASK               (0x7 << 20) /* The specific bit-field returns the consecutive number of times the Die temperatu */
#define CHARGER_TDIE_ERROR_DEBOUNCE_CNT_POS                (20) /* The specific bit-field returns the consecutive number of times the Die temperatu */
#define CHARGER_CHARGER_JEITA_STATE_MASK                   (0xF << 16) /* Returns the state of the Charger's JEITA FSM. This FSM is used to update the sta */
#define CHARGER_CHARGER_JEITA_STATE_POS                    (16) /* Returns the state of the Charger's JEITA FSM. This FSM is used to update the sta */
#define CHARGER_CHARGER_STATE_MASK                         (0xF << 12) /* Indicating the state of the Charger's main FSM, based on the following encoding: */
#define CHARGER_CHARGER_STATE_POS                          (12) /* Indicating the state of the Charger's main FSM, based on the following encoding: */
#define CHARGER_TBAT_STATUS_MASK                           (0x7 << 9) /* Battery pack temperature status, according to the following encoding: 0x0 : Batt */
#define CHARGER_TBAT_STATUS_POS                            (9) /* Battery pack temperature status, according to the following encoding: 0x0 : Batt */
#define CHARGER_MAIN_TBAT_COMP_OUT                         (1U << 8) /* Returns the status of the main battery temperature comparator. This comparator b */
#define CHARGER_TBAT_HOT_COMP_OUT                          (1U << 7) /* Returns the status of the battery temperature comparator dedicated to the Hot te */
#define CHARGER_TDIE_COMP_OUT                              (1U << 6) /* 0 = Die temperature is found to be below the programmed level, set in CHARGER_TE */
#define CHARGER_VBAT_OVP_COMP_OUT                          (1U << 5) /* 0 = Vbat has not exceeded the Over-Voltage Protection (OVP) voltage limit, accor */
#define CHARGER_MAIN_VBAT_COMP_OUT                         (1U << 4) /* This bit-field reflects the status of the main Vbat comparator residing in the a */
#define CHARGER_END_OF_CHARGE                              (1U << 3) /* 0 = Actual charge current is above the current level programmed in I_END_OF_CHAR */
#define CHARGER_CHARGER_CV_MODE                            (1U << 2) /* 0 = Charger's voltage loop not in regulation (or Charger is off) 1 = Charger's C */
#define CHARGER_CHARGER_CC_MODE                            (1U << 1) /* 0 = Charger's Current loop not in regulation (or Charger is off) 1 = Charger's C */
#define CHARGER_CHARGER_IS_POWERED_UP                      (1U << 0) /* 0 = Charger is either off or it is being powered-on but the analogue ciruitry is */

/* CHARGER_SWLOCK Register */

#define CHARGER_SWLOCK_FSM_STATE_MASK                      (0x3 << 1) /* Returns the state of the FSM detecting the sequence of writes that either enable */
#define CHARGER_SWLOCK_FSM_STATE_POS                       (1) /* Returns the state of the FSM detecting the sequence of writes that either enable */
#define CHARGER_SWLOCK_STATUS                              (1U << 0) /* 0 = SW locking is not active, writes to the protected Charger registers are allo */

/* CHARGER_TBAT_COMP_TIMER Register */

