AlmAck/svdtonuttx/demo/h/da1470x_charger.h
#define CHARGER_TBAT_COMP_TIMER_MASK                       (0x3FF << 16) /* Returns the main battery temperature comparator's timer, used for the latching o */
#define CHARGER_TBAT_COMP_TIMER_POS                        (16) /* Returns the main battery temperature comparator's timer, used for the latching o */
#define CHARGER_TBAT_COMP_SETTLING_MASK                    (0x3FF << 0) /* Settling time (specified in us) for the main battery temperature comparator, che */
#define CHARGER_TBAT_COMP_SETTLING_POS                     (0) /* Settling time (specified in us) for the main battery temperature comparator, che */

/* CHARGER_TBAT_MON_TIMER Register */

#define CHARGER_TBAT_MON_TIMER_MASK                        (0x3FF << 16) /* This is the battery temperature monitoring timer, counting with the Charger's 1- */
#define CHARGER_TBAT_MON_TIMER_POS                         (16) /* This is the battery temperature monitoring timer, counting with the Charger's 1- */
#define CHARGER_TBAT_MON_INTERVAL_MASK                     (0x3FF << 0) /* Timing interval (in ms) for the Battery temperature monitoring. This interval de */
#define CHARGER_TBAT_MON_INTERVAL_POS                      (0) /* Timing interval (in ms) for the Battery temperature monitoring. This interval de */

/* CHARGER_TDIE_COMP_TIMER Register */

#define CHARGER_TDIE_COMP_TIMER_MASK                       (0x3FF << 16) /* Returns the current value of the timer used to determine when the Die temperatur */
#define CHARGER_TDIE_COMP_TIMER_POS                        (16) /* Returns the current value of the timer used to determine when the Die temperatur */
#define CHARGER_TDIE_COMP_SETTLING_MASK                    (0x3FF << 0) /* Settling time threshold (in us) for the Die temperature comparator. */
#define CHARGER_TDIE_COMP_SETTLING_POS                     (0) /* Settling time threshold (in us) for the Die temperature comparator. */

/* CHARGER_TEMPSET2_PARAM Register */

#define CHARGER_TBAT_WARMER_MASK                           (0x3F << 18) /* This bit-field determines the battery temperature threshold above which the "WAR */
#define CHARGER_TBAT_WARMER_POS                            (18) /* This bit-field determines the battery temperature threshold above which the "WAR */
#define CHARGER_TBAT_WARM_MASK                             (0x3F << 12) /* This bit-field determines the battery temperature above which the charge current */
#define CHARGER_TBAT_WARM_POS                              (12) /* This bit-field determines the battery temperature above which the charge current */
#define CHARGER_TBAT_COOL_MASK                             (0x3F << 6) /* This bit-field determines the battery temperature below which the charge current */
#define CHARGER_TBAT_COOL_POS                              (6) /* This bit-field determines the battery temperature below which the charge current */
#define CHARGER_TBAT_COOLER_MASK                           (0x3F << 0) /* This bit-field determines the battery temperature below which the charge current */
#define CHARGER_TBAT_COOLER_POS                            (0) /* This bit-field determines the battery temperature below which the charge current */

/* CHARGER_TEMPSET_PARAM Register */

#define CHARGER_TDIE_MAX_MASK                              (0x7 << 12) /* This bit-field determines the maximum Die temperature level limit, ranging from  */
#define CHARGER_TDIE_MAX_POS                               (12) /* This bit-field determines the maximum Die temperature level limit, ranging from  */
#define CHARGER_TBAT_HOT_MASK                              (0x3F << 6) /* This bit-field determines the battery temperature above which the charge current */
#define CHARGER_TBAT_HOT_POS                               (6) /* This bit-field determines the battery temperature above which the charge current */
#define CHARGER_TBAT_COLD_MASK                             (0x3F << 0) /* This bit-field determines the battery temperature below which the charge current */
#define CHARGER_TBAT_COLD_POS                              (0) /* This bit-field determines the battery temperature below which the charge current */

/* CHARGER_THOT_COMP_TIMER Register */

#define CHARGER_THOT_COMP_TIMER_MASK                       (0x3FF << 16) /* Returns the battery temperature comparator's timer dedicated for the "Hot" level */
#define CHARGER_THOT_COMP_TIMER_POS                        (16) /* Returns the battery temperature comparator's timer dedicated for the "Hot" level */
#define CHARGER_THOT_COMP_SETTLING_MASK                    (0x3FF << 0) /* Charger's battery temperature comparator settling time (specified in us), specif */
#define CHARGER_THOT_COMP_SETTLING_POS                     (0) /* Charger's battery temperature comparator settling time (specified in us), specif */

/* CHARGER_TOTAL_CHARGE_TIMER Register */

#define CHARGER_TOTAL_CHARGE_TIMER_MASK                    (0xFFFF << 16) /* Returns the current value of the overall charge timeout counter, running at a 1- */
#define CHARGER_TOTAL_CHARGE_TIMER_POS                     (16) /* Returns the current value of the overall charge timeout counter, running at a 1- */
#define CHARGER_MAX_TOTAL_CHARGE_TIME_MASK                 (0xFFFF << 0) /* This bit-field determines the maximum overall charging time allowed (measured in */
#define CHARGER_MAX_TOTAL_CHARGE_TIME_POS                  (0) /* This bit-field determines the maximum overall charging time allowed (measured in */

/* CHARGER_VBAT_COMP_TIMER Register */

#define CHARGER_VBAT_COMP_TIMER_MASK                       (0x3FF << 16) /* Returns the current value of the timer used to determine when the output of the  */
#define CHARGER_VBAT_COMP_TIMER_POS                        (16) /* Returns the current value of the timer used to determine when the output of the  */
#define CHARGER_VBAT_COMP_SETTLING_MASK                    (0x3FF << 0) /* Settling time threshold (in ms) for the Vbat comparator checking Vbat vs the pro */
#define CHARGER_VBAT_COMP_SETTLING_POS                     (0) /* Settling time threshold (in ms) for the Vbat comparator checking Vbat vs the pro */

/* CHARGER_VOLTAGE_PARAM Register */

#define CHARGER_V_OVP_MASK                                 (0x3F << 18) /* This bit-field determines the VBAT Over-voltage protection limit. This Over-volt */
#define CHARGER_V_OVP_POS                                  (18) /* This bit-field determines the VBAT Over-voltage protection limit. This Over-volt */
#define CHARGER_V_REPLENISH_MASK                           (0x3F << 12) /* This bit-field determines the absolute value (in V) of the Replenish voltage thr */
#define CHARGER_V_REPLENISH_POS                            (12) /* This bit-field determines the absolute value (in V) of the Replenish voltage thr */
#define CHARGER_V_PRECHARGE_MASK                           (0x3F << 6) /* This bit-field determines the voltage level at which the battery is considered a */
#define CHARGER_V_PRECHARGE_POS                            (6) /* This bit-field determines the voltage level at which the battery is considered a */
#define CHARGER_V_CHARGE_MASK                              (0x3F << 0) /* This bit-field determines the charge voltage levels supported. The supported lev */
#define CHARGER_V_CHARGE_POS                               (0) /* This bit-field determines the charge voltage levels supported. The supported lev */

