AlmAck/svdtonuttx/demo/h/da1470x_charger.h
/* CHARGER_VOLTAGE_STATUS Register */

#define CHARGER_V_OVP_SET_MASK                             (0x3F << 18) /* This bit-field returns the applied V_OVP setting. In JEITA charging, it contains */
#define CHARGER_V_OVP_SET_POS                              (18) /* This bit-field returns the applied V_OVP setting. In JEITA charging, it contains */
#define CHARGER_V_REPLENISH_SET_MASK                       (0x3F << 12) /* This bit-field returns the applied V_REPLENISH setting. In JEITA charging, it co */
#define CHARGER_V_REPLENISH_SET_POS                        (12) /* This bit-field returns the applied V_REPLENISH setting. In JEITA charging, it co */
#define CHARGER_V_PRECHARGE_SET_MASK                       (0x3F << 6) /* This bit-field returns the applied V_PRECHARGE setting. In JEITA charging, it co */
#define CHARGER_V_PRECHARGE_SET_POS                        (6) /* This bit-field returns the applied V_PRECHARGE setting. In JEITA charging, it co */
#define CHARGER_V_CHARGE_SET_MASK                          (0x3F << 0) /* This bit-field returns the applied V_CHARGE setting. In JEITA charging, it conta */
#define CHARGER_V_CHARGE_SET_POS                           (0) /* This bit-field returns the applied V_CHARGE setting. In JEITA charging, it conta */

/* CHARGER_VOVP_COMP_TIMER Register */

#define CHARGER_OVP_INTERVAL_CHECK_TIMER_MASK              (0x3F << 26) /* The specific bit-field determines the current state of the timer used to periodi */
#define CHARGER_OVP_INTERVAL_CHECK_TIMER_POS               (26) /* The specific bit-field determines the current state of the timer used to periodi */
#define CHARGER_VBAT_OVP_COMP_TIMER_MASK                   (0x3FF << 16) /* Returns the current value of the timer used to determine when the Vbat Over-Volt */
#define CHARGER_VBAT_OVP_COMP_TIMER_POS                    (16) /* Returns the current value of the timer used to determine when the Vbat Over-Volt */
#define CHARGER_OVP_INTERVAL_CHECK_THRES_MASK              (0x3F << 10) /* This bit-field determines the periodic interval of checking the dedicated Vbat O */
#define CHARGER_OVP_INTERVAL_CHECK_THRES_POS               (10) /* This bit-field determines the periodic interval of checking the dedicated Vbat O */
#define CHARGER_VBAT_OVP_COMP_SETTLING_MASK                (0x3FF << 0) /* Settling time threshold (in ms) for the Vbat comparator checking Vbat vs the pro */
#define CHARGER_VBAT_OVP_COMP_SETTLING_POS                 (0) /* Settling time threshold (in ms) for the Vbat comparator checking Vbat vs the pro */

#endif /* __DA1470X_CHARGER_H */
